{"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_203", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_203", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_203", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_203", "inbound_nodes": [[["conv2d_203", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_203", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_203", "inbound_nodes": [[["batch_normalization_203", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_204", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_204", "inbound_nodes": [[["activation_203", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_204", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_204", "inbound_nodes": [[["conv2d_204", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_204", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_204", "inbound_nodes": [[["batch_normalization_204", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_205", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_205", "inbound_nodes": [[["activation_204", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_205", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_205", "inbound_nodes": [[["conv2d_205", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_205", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_205", "inbound_nodes": [[["batch_normalization_205", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_4", "inbound_nodes": [[["activation_205", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_206", "trainable": false, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_206", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_206", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_206", "inbound_nodes": [[["conv2d_206", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_206", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_206", "inbound_nodes": [[["batch_normalization_206", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_207", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_207", "inbound_nodes": [[["activation_206", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_207", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_207", "inbound_nodes": [[["conv2d_207", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_207", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_207", "inbound_nodes": [[["batch_normalization_207", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_5", "inbound_nodes": [[["activation_207", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_211", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_211", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_211", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_211", "inbound_nodes": [[["conv2d_211", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_211", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_211", "inbound_nodes": [[["batch_normalization_211", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_209", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_209", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_212", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_212", "inbound_nodes": [[["activation_211", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_209", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_209", "inbound_nodes": [[["conv2d_209", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_212", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_212", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_209", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_209", "inbound_nodes": [[["batch_normalization_209", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_212", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_212", "inbound_nodes": [[["batch_normalization_212", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_208", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_208", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_210", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_210", "inbound_nodes": [[["activation_209", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_213", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_213", "inbound_nodes": [[["activation_212", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_214", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_214", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_208", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_208", "inbound_nodes": [[["conv2d_208", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_210", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_210", "inbound_nodes": [[["conv2d_210", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_213", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_213", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_214", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_214", "inbound_nodes": [[["conv2d_214", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_208", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_208", "inbound_nodes": [[["batch_normalization_208", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_210", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_210", "inbound_nodes": [[["batch_normalization_210", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_213", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_213", "inbound_nodes": [[["batch_normalization_213", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_214", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_214", "inbound_nodes": [[["batch_normalization_214", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed_5b", "trainable": false, "dtype": "float32", "axis": 3}, "name": "mixed_5b", "inbound_nodes": [[["activation_208", 0, 0, {}], ["activation_210", 0, 0, {}], ["activation_213", 0, 0, {}], ["activation_214", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_218", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_218", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_218", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_218", "inbound_nodes": [[["conv2d_218", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_218", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_218", "inbound_nodes": [[["batch_normalization_218", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_216", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_216", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_219", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_219", "inbound_nodes": [[["activation_218", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_216", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_216", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_219", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_219", "inbound_nodes": [[["conv2d_219", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_216", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_216", "inbound_nodes": [[["batch_normalization_216", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_219", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_219", "inbound_nodes": [[["batch_normalization_219", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_215", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_215", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_217", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_217", "inbound_nodes": [[["activation_216", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_220", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_220", "inbound_nodes": [[["activation_219", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_215", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_215", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_217", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_217", "inbound_nodes": [[["conv2d_217", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_220", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_220", "inbound_nodes": [[["conv2d_220", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_215", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_215", "inbound_nodes": [[["batch_normalization_215", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_217", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_217", "inbound_nodes": [[["batch_normalization_217", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_220", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_220", "inbound_nodes": [[["batch_normalization_220", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "block35_1_mixed", "trainable": false, "dtype": "float32", "axis": 3}, "name": "block35_1_mixed", "inbound_nodes": [[["activation_215", 0, 0, {}], ["activation_217", 0, 0, {}], ["activation_220", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block35_1_conv", "trainable": false, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block35_1_conv", "inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "block35_1", "trainable": false, "dtype": "float32", "function": ["4wIAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMUAAAAfABkARkAfABkAhkAfAEUABcAUwApA07pAAAA\nAOkBAAAAqQApAtoGaW5wdXRz2gVzY2FsZXIDAAAAcgMAAAD6ckM6L1VzZXJzL0luZHJhL2FuYWNv\nbmRhMy9lbnZzL3RmLWdwdS9saWIvc2l0ZS1wYWNrYWdlcy90ZW5zb3JmbG93L3B5dGhvbi9rZXJh\ncy9hcHBsaWNhdGlvbnMvaW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT5xAQAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "tensorflow.python.keras.applications.inception_resnet_v2", "output_shape": [29, 29, 320], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "block35_1", "inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block35_1_ac", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "block35_1_ac", "inbound_nodes": [[["block35_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_224", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_224", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_224", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_224", "inbound_nodes": [[["conv2d_224", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_224", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_224", "inbound_nodes": [[["batch_normalization_224", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_222", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_222", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_225", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_225", "inbound_nodes": [[["activation_224", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_222", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_222", "inbound_nodes": [[["conv2d_222", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_225", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_225", "inbound_nodes": [[["conv2d_225", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_222", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_222", "inbound_nodes": [[["batch_normalization_222", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_225", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_225", "inbound_nodes": [[["batch_normalization_225", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_221", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_221", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_223", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_223", "inbound_nodes": [[["activation_222", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_226", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_226", "inbound_nodes": [[["activation_225", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_221", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_221", "inbound_nodes": [[["conv2d_221", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_223", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_223", "inbound_nodes": [[["conv2d_223", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_226", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_226", "inbound_nodes": [[["conv2d_226", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_221", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_221", "inbound_nodes": [[["batch_normalization_221", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_223", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_223", "inbound_nodes": [[["batch_normalization_223", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_226", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_226", "inbound_nodes": [[["batch_normalization_226", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "block35_2_mixed", "trainable": false, "dtype": "float32", "axis": 3}, "name": "block35_2_mixed", "inbound_nodes": [[["activation_221", 0, 0, {}], ["activation_223", 0, 0, {}], ["activation_226", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block35_2_conv", "trainable": false, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block35_2_conv", "inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "block35_2", "trainable": false, "dtype": "float32", "function": ["4wIAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMUAAAAfABkARkAfABkAhkAfAEUABcAUwApA07pAAAA\nAOkBAAAAqQApAtoGaW5wdXRz2gVzY2FsZXIDAAAAcgMAAAD6ckM6L1VzZXJzL0luZHJhL2FuYWNv\nbmRhMy9lbnZzL3RmLWdwdS9saWIvc2l0ZS1wYWNrYWdlcy90ZW5zb3JmbG93L3B5dGhvbi9rZXJh\ncy9hcHBsaWNhdGlvbnMvaW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT5xAQAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "tensorflow.python.keras.applications.inception_resnet_v2", "output_shape": [29, 29, 320], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "block35_2", "inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block35_2_ac", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "block35_2_ac", "inbound_nodes": [[["block35_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_230", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_230", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_230", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_230", "inbound_nodes": [[["conv2d_230", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_230", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_230", "inbound_nodes": [[["batch_normalization_230", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_228", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_228", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_231", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_231", "inbound_nodes": [[["activation_230", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_228", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_228", "inbound_nodes": [[["conv2d_228", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_231", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_231", "inbound_nodes": [[["conv2d_231", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_228", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_228", "inbound_nodes": [[["batch_normalization_228", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_231", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_231", "inbound_nodes": [[["batch_normalization_231", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_227", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_227", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_229", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_229", "inbound_nodes": [[["activation_228", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_232", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_232", "inbound_nodes": [[["activation_231", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_227", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_227", "inbound_nodes": [[["conv2d_227", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_229", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_229", "inbound_nodes": [[["conv2d_229", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_232", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_232", "inbound_nodes": [[["conv2d_232", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_227", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_227", "inbound_nodes": [[["batch_normalization_227", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_229", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_229", "inbound_nodes": [[["batch_normalization_229", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_232", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_232", 